_posts/programming/2023-07-23-cppcoreguidelines-e2.html
---
layout: post
title: CppCoreGuidelines E.2 用抛出异常作为信号说明函数无法处理分配给它的任务
categories: [technology]
tags: [CppCoreGuidelines]
---
<p>
<a href="http://kimi.im/tags.html#CppCoreGuidelines-ref">C++ 核心指南目录</a>
</p>

<p>
&ldquo;Throw an exception to signal that a function can’t perform its assigned task&rdquo;
</p>

<p>
理由
</p>

<p>
这种方法可以把出错处理过程变得更系统、稳固，且避免代码重复。
</p>

<p>
例子
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #7F0055; font-weight: bold;">struct</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">Foo</span> <span style="color: #707183;">{</span>
    <span style="color: #000000; font-style: italic; text-decoration: underline;">vector</span><span style="color: #7388d6;">&lt;</span>Thing<span style="color: #7388d6;">&gt;</span> <span style="color: #000000;">v</span>;
    <span style="color: #000000; font-style: italic; text-decoration: underline;">File_handle</span> <span style="color: #000000;">f</span>;
    <span style="color: #000000; font-style: italic; text-decoration: underline;">string</span> <span style="color: #000000;">s</span>;
<span style="color: #707183;">}</span>;

<span style="color: #000000; font-style: italic; text-decoration: underline;">void</span> <span style="color: #0000ff; font-weight: bold;">use</span><span style="color: #707183;">()</span>
<span style="color: #707183;">{</span>
    <span style="color: #000000; font-style: italic; text-decoration: underline;">Foo</span> <span style="color: #000000;">bar</span> <span style="color: #7388d6;">{</span><span style="color: #909183;">{</span>Thing<span style="color: #709870;">{</span>1<span style="color: #709870;">}</span>, Thing<span style="color: #709870;">{</span>2<span style="color: #709870;">}</span>, Thing<span style="color: #709870;">{</span>monkey<span style="color: #709870;">}</span><span style="color: #909183;">}</span>,
             <span style="color: #909183;">{</span><span style="color: #2A00FF;">"my_file"</span>, <span style="color: #2A00FF;">"r"</span><span style="color: #909183;">}</span>, <span style="color: #2A00FF;">"Here we go!"</span><span style="color: #7388d6;">}</span>;
    <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">...</span>
<span style="color: #707183;">}</span>
</pre>
</div>

<p>
这里， <code>vector</code> 和 <code>string</code> 的构造函数可能无法分配到足够的内存给其内部元素。
<code>vector</code> 构造函数可能无法把初始化列表中的东西复制过来， <code>File_handle</code> 可能不能打开文件。在各种可能出错的情况下，都会抛出异常给调用函数 <code>use()</code> 来处理。 <code>use()</code> 函数可以通过 <code>try/catch</code> 来处理构造 <code>bar</code> 的过程中出现的错误。出现错误的时候， <code>Foo</code> 的构造函数会在转交控制权之前，正确销毁已经构造的成员。
</p>

<p>
注意，这里没有包含错误码的返回值。
</p>

<p>
<code>File_handle</code> 构造函数可能可以这样定义：
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #110099;">File_handle</span>::<span style="color: #0000ff; font-weight: bold;">File_handle</span><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">const</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">string</span>&amp; <span style="color: #000000;">name</span>, <span style="color: #7F0055; font-weight: bold;">const</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">string</span>&amp; <span style="color: #000000;">mode</span><span style="color: #707183;">)</span>
    : f<span style="color: #707183;">{</span>fopen<span style="color: #7388d6;">(</span>name.c_str<span style="color: #909183;">()</span>, mode.c_str<span style="color: #909183;">()</span><span style="color: #7388d6;">)</span><span style="color: #707183;">}</span>
<span style="color: #707183;">{</span>
    <span style="color: #7F0055; font-weight: bold;">if</span> <span style="color: #7388d6;">(</span>!f<span style="color: #7388d6;">)</span>
        <span style="color: #7F0055; font-weight: bold;">throw</span> runtime_error<span style="color: #7388d6;">{</span><span style="color: #2A00FF;">"File_handle: could not open "</span>
                            + name + <span style="color: #2A00FF;">" as "</span> + mode<span style="color: #7388d6;">}</span>;
<span style="color: #707183;">}</span>
</pre>
</div>

<p>
注意
</p>

<p>
人们经常说异常意味着异常的事件或者异常的错误的信号。但是，这里有些同义反复，到底什么是异常的？
</p>

<p>
例子
</p>
<ul class="org-ul">
<li>一个前提条件没法满足</li>
<li>一个构造函数无法构造一个对象（构造一个类的不变式的过程失败了）</li>
<li>超出范围错误（比如， <code>v[v.size()] = 7</code> ）</li>
<li>无法获取一个资源（比如，网络连接断开）</li>
</ul>

<p>
相反的，一个普通循环的结束，不算是异常的。除非这个循环是无限循环。这时候，提前结束意味着异常情况。
</p>

<p>
注意
</p>

<p>
不要通过 <code>throw</code> 作为从函数返回值的一种简单替代。
</p>

<p>
例外情况
</p>

<p>
像硬实时系统之类的系统，会要求固定的最大时间内响应事件。这时候，我们必须有工具确保在指定时间内能从 <code>throw</code> 恢复的情况。
</p>

<p>
注意
</p>

<p>
如果你无法承受异常，或者不喜欢基于异常的出错处理，请在做出决定之前，考虑其他选项。当然这些选项有其自身的复杂性和问题。一定要记住，在申明性能效率之前，要做出一定的度量。
</p>
